Catalogs/А_СтруктураСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>А_СтруктураСебестоимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПроизводство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладМонтаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>А_КоличествоМодулей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Комплектующие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбщееНазвание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ОбщиеНазванияНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаВыезде</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Работы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.А_ЭтапыРабот</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Работа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Единица</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаВыезде</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/А_СтруктураСебестоимости/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КомплектующиеНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Комплектующие.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если НЕ ЗначениеЗаполнено(ТекущиеДанные.ОбщееНазвание) Тогда
        СтандартнаяОбработка = Ложь;
        ПоказатьПредупреждение(, "Спочатку заповніть ""Загальну назву"" у поточному рядку!");
        Возврат;
    КонецЕсли;
    
    СтандартнаяОбработка = Ложь;
    
    ПараметрыОткрытия = Новый Структура;
    ПараметрыОткрытия.Вставить("Отбор", Новый Структура("ОбщееНазваниеНоменклатуры, Услуга", ТекущиеДанные.ОбщееНазвание,Ложь));
    
    ОткрытьФорму("Справочник.Номенклатура.ФормаВыбора", ПараметрыОткрытия, Элемент,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
    
КонецПроцедуры

&НаКлиенте
Процедура КомплектующиеОбщееНазваниеПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Комплектующие.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    Если ЗначениеЗаполнено(ТекущиеДанные.ОбщееНазвание) Тогда
       ТекущиеДанные.Номенклатура = ОсновнаяНоменклатура(ТекущиеДанные.ОбщееНазвание);
	   Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда   
		   ТекущиеДанные.Единица = ПолучитьЕдиницу(ТекущиеДанные.Номенклатура);
	   КонецЕсли;
	КонецЕсли;
КонецПроцедуры    

Функция ОсновнаяНоменклатура(ОбщееНазвание)
Возврат ОбщееНазвание.ОсновнаяНоменклатура;
КонецФункции      

Функция ПолучитьЕдиницу(Номенклатура)
Возврат Номенклатура.БазоваяЕдиницаИзмерения;
КонецФункции   

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.Активная Тогда 
		Код = ПроверитьАктивные();  
		Если Код <> Неопределено Тогда   
			Отказ = Истина;
			ПоказатьПредупреждение(, "Вже існує активна структура по підрозділу та складу з кодом " + Код);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры    


Функция ПроверитьАктивные()     
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СтруктураСебестоимости.Код КАК Код
	|ИЗ
	|	Справочник.А_СтруктураСебестоимости КАК СтруктураСебестоимости
	|ГДЕ
	|	СтруктураСебестоимости.Подразделение = &Подразделение
	|	И СтруктураСебестоимости.Склад = &Склад
	|	И СтруктураСебестоимости.Активная
	|	И СтруктураСебестоимости.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("Склад",  Объект.Склад); 
	Запрос.УстановитьПараметр("Ссылка",  Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Код;
	ИНАЧЕ
		Возврат Неопределено
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура КомплектующиеНоменклатураПриИзменении(Элемент)
	ТекущиеДанные = Элементы.Комплектующие.ТекущиеДанные;
    Если ТекущиеДанные = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
	Если ЗначениеЗаполнено(ТекущиеДанные.Номенклатура) Тогда 
		ТекущиеДанные.Единица = ПолучитьЕдиницу(ТекущиеДанные.Номенклатура);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СкладПриИзмененииНаСервере()
Объект.Подразделение = Объект.Склад.Подразделение;
ИзменитьНаименование();

КонецПроцедуры

&НаКлиенте
Процедура СкладПриИзменении(Элемент)
	СкладПриИзмененииНаСервере();
КонецПроцедуры   

Процедура  ИзменитьНаименование() 
	Если ЗначениеЗаполнено(Объект.Подразделение) И ЗначениеЗаполнено(Объект.Склад) Тогда
		Объект.Наименование = Строка(Объект.Подразделение) + " / " + Строка(Объект.Склад);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	ИзменитьНаименование() 
КонецПроцедуры

&НаКлиенте
Процедура Загрузить(Команда)
    
    Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
    Диалог.Заголовок = "Виберіть файл Excel";
    Диалог.Фильтр = "Книги Excel|*.xlsx;*.xls";
    
    Оповещение = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект);
    Диалог.Показать(Оповещение);
    
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДопПараметры) Экспорт
    
    Если ВыбранныеФайлы = Неопределено Тогда
        Возврат;
    КонецЕсли;
    
    ИмяФайла = ВыбранныеФайлы[0];
    
    НачатьПомещениеФайла(
        Новый ОписаниеОповещения("ПомещениеФайлаЗавершение", ЭтотОбъект, ИмяФайла),
        ,
        ИмяФайла,
        Ложь,
        УникальныйИдентификатор);
    
КонецПроцедуры

&НаКлиенте
Процедура ПомещениеФайлаЗавершение(Результат, Адрес, ВыбранноеИмяФайла, ДопПараметры) Экспорт
    
    Если Не Результат Тогда
        Возврат;
    КонецЕсли;
    
    // Отримуємо список листів
    СписокЛистов = ПолучитьСписокЛистовНаСервере(Адрес);
    
    Если СписокЛистов.Количество() = 0 Тогда
        ПоказатьПредупреждение(, "Не вдалося прочитати файл Excel або в ньому немає листів.");
        Возврат;
    КонецЕсли;
    
    Если СписокЛистов.Количество() = 1 Тогда
        ЗагрузитьДанныеИзExcelНаСервере(Адрес, СписокЛистов[0].Значение);
    Иначе
        Оповещение = Новый ОписаниеОповещения("ВыборЛистаЗавершение", ЭтотОбъект, Адрес);
        СписокЛистов.ПоказатьВыборЭлемента(Оповещение, "Оберіть лист для завантаження");
    КонецЕсли;
    
КонецПроцедуры

&НаКлиенте
Процедура ВыборЛистаЗавершение(ВыбранныйЭлемент, Адрес) Экспорт
    Если ВыбранныйЭлемент <> Неопределено Тогда
        ЗагрузитьДанныеИзExcelНаСервере(Адрес, ВыбранныйЭлемент.Значение);
    КонецЕсли;
КонецПроцедуры

// ================================== СЕРВЕР ==================================

&НаСервере
Функция ПолучитьСписокЛистовНаСервере(АдресВоВременномХранилище)
    
    Список = Новый СписокЗначений;
    
    ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
    ДвоичныеДанные.Записать(ИмяФайла);
    
    Попытка
        Excel = Новый COMОбъект("Excel.Application");
        Excel.Visible = Ложь;
        Excel.DisplayAlerts = Ложь;
        
        Книга = Excel.Workbooks.Open(ИмяФайла);
        
        Для і = 1 По Книга.Sheets.Count Цикл
            Лист = Книга.Sheets(і);
            Список.Добавить(Лист.Name, Лист.Name);
        КонецЦикла;
        
        Книга.Close(Ложь);
        Excel.Quit();
        
    Исключение
        Сообщить("Помилка при отриманні списку листів: " + ОписаниеОшибки());
    КонецПопытки;
    
    // Прибирання
    Попытка
        УдалитьФайлы(ИмяФайла);
    Исключение
    КонецПопытки;
    
    Возврат Список;
    
КонецФункции

&НаСервере
Процедура ЗагрузитьДанныеИзExcelНаСервере(АдресВоВременномХранилище, ИмяЛиста)
    
    Объект.Комплектующие.Очистить();
    
    ИмяФайла = ПолучитьИмяВременногоФайла("xlsx");
    ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
    ДвоичныеДанные.Записать(ИмяФайла);
    
    Попытка
        Excel = Новый COMОбъект("Excel.Application");
        Excel.Visible = Ложь;
        Excel.DisplayAlerts = Ложь;
        
        Книга = Excel.Workbooks.Open(ИмяФайла);
        Лист = Книга.Sheets(ИмяЛиста);
        
        // Визначаємо останню заповнену строку
        ПоследняяСтрока = Лист.Cells(Лист.Rows.Count, 1).End(-4162).Row; // xlUp = -4162
        
        Для НомерСтроки = 2 По ПоследняяСтрока Цикл   // 1 рядок — шапка
            
            Название = СокрЛП(Строка(Лист.Cells(НомерСтроки, 1).Value));
            Если ПустаяСтрока(Название) Тогда
                Продолжить;
            КонецЕсли;
            
            КоличествоСтр = СокрЛП(Строка(Лист.Cells(НомерСтроки, 2).Value));
            СуммаСтр      = СокрЛП(Строка(Лист.Cells(НомерСтроки, 4).Value));
            
            Попытка
                Количество = Число(СтрЗаменить(СтрЗаменить(КоличествоСтр," ",""), ",", "."))
            Исключение
                Количество = 0;
            КонецПопытки;
            
            Попытка
                Сумма = Число(СтрЗаменить(СтрЗаменить(СуммаСтр," ",""), ",", "."));
            Исключение
                Сумма = 0;
            КонецПопытки;
            
            НоменклатураСсылка = НайтиНоменклатуруПоНазванию(Название);
            
			Если ЗначениеЗаполнено(НоменклатураСсылка) Тогда
				стр = Объект.Комплектующие.Добавить();
				стр.ОбщееНазвание = НоменклатураСсылка;
				стр.Количество   = Количество;
				стр.Сумма        = Сумма;
				Номенклатура = НоменклатураСсылка.ОсновнаяНоменклатура;
				
				Если ЗначениеЗаполнено(Номенклатура) Тогда 
					стр.Номенклатура = Номенклатура; 
					стр.Единица      = Номенклатура.БазоваяЕдиницаИзмерения;
				Иначе         
					Сообщить("Строка№"+НомерСтроки+ "Не вказано основну номенклатуру в загалный назві: "+Название);
				КонецЕсли;
				
			Иначе
				Сообщить("Строка№"+НомерСтроки+" Не знайдено назву: " + Название);
			КонецЕсли;
            
        КонецЦикла;
        
        Книга.Close(Ложь);
        Excel.Quit();
        
        Сообщить("Завантажено рядків: " + Объект.Комплектующие.Количество());
        
    Исключение
        Сообщить("Помилка завантаження: " + ОписаниеОшибки());
    КонецПопытки;
    
    Попытка
        УдалитьФайлы(ИмяФайла);
    Исключение
    КонецПопытки;
    
КонецПроцедуры

&НаСервере
Функция НайтиНоменклатуруПоНазванию(Название)
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ ПЕРВЫЕ 1
    |	Номенклатура.Ссылка
    |ИЗ
    |	Справочник.ОбщиеНазванияНоменклатуры КАК Номенклатура
    |ГДЕ
    |	Номенклатура.Наименование = &Наименование
    |	И НЕ Номенклатура.ПометкаУдаления";
    
    Запрос.УстановитьПараметр("Наименование", Название);
    
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Ссылка;
    КонецЕсли;
    
    Возврат Справочники.ОбщиеНазванияНоменклатуры.ПустаяСсылка();
    
КонецФункции

&НаКлиенте
Процедура РаботыКоличествоПриИзмененииНаСервере(ТекущаяСтрока) 
	
	ТекущаяСтрока.Сумма = Окр(ТекущаяСтрока.Количество*ТекущаяСтрока.Цена,2);  
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыКоличествоПриИзменении(Элемент)  
	
	ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;

	РаботыКоличествоПриИзмененииНаСервере(ТекущаяСтрока);   
	
КонецПроцедуры

&НаКлиенте
Процедура РаботыЦенаПриИзменении(Элемент)
	
ТекущаяСтрока = Элементы.Работы.ТекущиеДанные;

	РаботыКоличествоПриИзмененииНаСервере(ТекущаяСтрока);   
	
КонецПроцедуры
